OdDAI.Schema.m_instanceFactory
An array of external schemas for the schema.

OdDAI.Schema.m_unnamedTypesArray
An array of entity type definitions without names that are contained in the schema.

OdDAI.Schema.m_unnamedTypes
Entity type definitions without names that are contained in the schema.

OdDAI.Schema.m_globalRules
Set of Global Rules definitions declared in the schema.

OdDAI.Schema.m_types
Type definitions that are contained in the schema.

OdDAI.Schema.m_complexEntities
Complex entity type definitions. Contains entities not explicitly specified in schema.

OdDAI.Schema.m_complexEntitiesMutex
Complex entity type definitions mutex.

OdDAI.Schema.m_entities
Entity definitions that are contained in the schema.

OdDAI.Schema.m_name
The schema name.

OdDAI.Schema.setInterfaceSpecification(OdSmartPtr&lt;OdDAI.InterfaceSpec&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of External Schemas for the schema.
\param externalSchemas [in] A set of External Schemas to assign to the schema definition.
\remarks
This method is for internal use only.
\details
Sets an interface specification for the schema.
\param interfaceSpec [in] A smart pointer to InterfaceSpec to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setGlobalRules(OdArray&lt;OdSmartPtr&lt;OdDAI.GlobalRule&gt;,OdObjectsAllocator&lt;OdSmartPtr&lt;OdDAI.GlobalRule&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of Global Rules for the schema.
\param globalRules [in] A set of Global Rules to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setUnnamedTypes(OdSmartPtr&lt;OdRxDictionary&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of unnamed types for the schema.
\param types [in] A set of unnamed types to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setTypes(OdSmartPtr&lt;OdRxDictionary&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of defined types for the schema.
\param types [in] A set of defined types to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setComplexEntities(OdSmartPtr&lt;OdRxDictionary&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of entity definitions for the schema.
\param entities [in] A set of entity definitions to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setEntities(OdSmartPtr&lt;OdRxDictionary&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of entity definitions for the schema.
\param entities [in] A set of entity definitions to assign to the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.setName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new name for the schema definition.
\param name [in] A name for the schema definition.
\remarks
This method is for internal use only.

OdDAI.Schema.interfaceSpecification
\details
Retrieves a set of assigned External Schemas for the schema.
\returns an constant OdArray of smart pointers to ExternalSchema objects.
\details
Retrieves an interface specification for the schema definition.
\returns a smart pointer to InterfaceSpecification instance, if cross-references are present for the schema; otherwise returns nullptr.

OdDAI.Schema.getComplexEntity(OdDAI.List&lt;OdAnsiString&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a complex entity from list of entity names collection.
\param entityNameCollection [in] Collection of already created entity names.
\returns created complex entity if success, otherwise return empty pointer.

OdDAI.Schema.getComplexEntity(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a complex entity from name.
\param entityName [in] Name of complex entity. It should contain names of sub entities, separated by '+'.
\returns Smart pointer to newly created (or existing) complex entity, if success; otherwise returns empty pointer.

OdDAI.Schema.writeToFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Writes data from the schema object to a physical file.
\param fileName [in] A string that contains the full path to the output file to write data.
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdDAI.Schema.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Schema.name
\details
Retrieves the name of the schema.
\returns An ANSI string that contains the name of the schema.

OdDAI.Schema.Dispose
\details
Destroys the schema object.

OdDAI.Schema
\details
A class that implements working with a schema definition.